[
  {
    "postName": "The Lord of the Furries",
    "postType": "Building",
    "postAuthor": "Ethan",
    "postDate": "5/30/2021",
    "postData": "The taven is crusty. Words words ridiculously-big word wod wooord bongo bingo bongo. Test test. N-u-l-l. I want this to be very long so I am going to type a lot of random text in here that you would perhaps see in an actual post. Because let's be real: *someone* is gonna go Stephan King and post a novel as a post. It's going to be 350 pages of proof-read fan-fiction about furries, romance, and - for some odd reason - Dwayne The Rock Johnson. And we'll have to make sure that...thing fits in our post holder.\n\nChapter 1: Lord Fur-Quad and the bling-ring of power.\n\n\tIt all began one summer afternoon when Lord Fur-Quad was searching for his furry bride-to-be. Dwayne The Rock Johnson just happened to show up, and he asked to duel Lord Fur-Quad in a duel of epic duel-ality. Lord Fur-Quad, in all his epic furry-ness, accepted and thought the battle would be easily won."
  },
  {
    "postName": "The Nasty Bathroom",
    "postType": "Room",
    "postAuthor": "RandomUser",
    "postDate": "8/12/1998",
    "postData": "The bathroom was worn down and the floors were wet with what was hopefully water"
  },
  {
    "postName": "Goblins Galore!",
    "postType": "Room",
    "postAuthor": "CC",
    "postDate": "6/8/2021",
    "postData": " \tr\n\t    \t\tObserving the North end of the room...\n\t    \t\tA wooden table covered with a red velvet cloth has three items neatly lined up on it: <input>\n\t    \t\tObserving the East end of the room...\n\t    \t\tThere is a oak service desk fitted with glass, allowing items to be placed and viewed from inside the desk. On top of the desk is a small copper bell with the words \"ring for service\" etched into it in common.\n\t    \t\tObserving the South end of the room...\n\t    \t\tThere is a oak service desk fitted with glass, allowing items to be placed and viewed from inside the desk. On top of the desk is a small copper bell with the words \"ring for service\" etched into it in common.\n\t    \t\tObserving the West end of the room...\n\t    \t\tThere is a oak service desk fitted with glass, allowing items to be placed and viewed from inside the desk. On top of the desk is a small copper bell with the words \"ring for service\" etched into it in common.\n\t    \t\tLooking to the Center of the room...\n\t    \t\tA crystal ball floats above a dark pine table. Inside the ball, a purple mist swirls and churns like the waves of the sea.\n"
  },
  {
    "postName": "Wizards no more!",
    "postType": "Room",
    "postAuthor": "GG",
    "postDate": "6/8/2021",
    "postData": " \tThe ground is peppered with blood stains; the smell of iron and ruslingers in the air.\n\t    \t\tLooking to the North end of the room...\n\t    \t\tA bone pile mixed in iron scrap and cloth to one side, and on the other, a table with make-shift tools. Some small pieces of “clothes” and armor hang from hooks.\n\t    \t\tObserving the East end of the room...\n\t    \t\tHalf Broken crates and slightly torn bags of food are scattered everywhere. Flies swarm overhead, and what little vegetables they seem willing to eat lays side-by-side with raw meat.\n\t    \t\tObserving the South end of the room...\n\t    \t\tA jagady stone with little features to make out at first glance. On closer inspection however, it is clear that it is covered in scratch marks, likely where the goblins would sharpen their claws.\n\t    \t\tIn the West end of the room...\n\t    \t\tSleeping racks and bags. Some filled with hay or soft moss for softer bedding. Others with a worn animal hide that was probably not tanned properly.\n\t    \t\tLooking to the Center of the room...\n\t    \t\tRacks of spoils hang from above and all along the floor, strewn about haphazardly. The treasure of unwitting merchants and foolish adventurers alike. Spices, food, coin, weapons, and armor of varying qualities. \n"
  },
  {
    "postName": "Cool post",
    "postType": "Room",
    "postAuthor": "Random Dude",
    "postDate": "6/8/2021",
    "postData": " \tThe shop is small and homey; it is made of wooden planks and cobblestone.\n\t    \t\tIn the North end of the room...\n\t    \t\tWooden shelves carry small baskets of berries and a variety of fruits.\n\t    \t\tIn the East end of the room...\n\t    \t\tWooden shelves carry small baskets of berries and a variety of fruits.\n\t    \t\tObserving the South end of the room...\n\t    \t\tA display stand showcases some pottery. (fill in the blank)\n\t    \t\tLooking to the West end of the room...\n\t    \t\tThere is a wooden table. On it are large slices of cured meats.\n\t    \t\tIn the Center of the room...\n\t    \t\tLying on the ground is a fluffy, human-sized teddy bear."
  }
]